---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.Value
source: html/d4a5ac3d-c5c4-b7d8-2555-b04d2f26e422.htm
---
# Autodesk.Revit.DB.DimensionSegment.Value Property

The length of the segment.

## Syntax (C#)
```csharp
public Nullable<double> Value { get; }
```